@Jberlinsky I'm getting this when running a terraform apply with the following definition, using this branch.

Below is the full output, including the plan
```
module.enable_apis.google_project_service.project_services["memcache.googleapis.com"]: Refreshing state... [id=REDACTED/memcache.googleapis.com]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_memcache_instance.self will be created
  + resource "google_memcache_instance" "self" {
      + authorized_network = "projects/REDACTED/global/networks/shared"
      + create_time        = (known after apply)
      + display_name       = "REDACTED memcache"
      + id                 = (known after apply)
      + name               = "REDACTED"
      + node_count         = 1
      + project            = "REDACTED"
      + region             = "us-central1"
      + zones              = (known after apply)

      + memcache_parameters {
          + id     = (known after apply)
          + params = {
              + "listen-backlog" = "2048"
              + "max-item-size"  = "8388608"
            }
        }

      + node_config {
          + cpu_count      = 1
          + memory_size_mb = 1024
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_memcache_instance.self: Creating...

Error: Error creating Instance: googleapi: Error 400: Invalid JSON payload received. Unknown name "memcacheParameters" at 'resource': Cannot find field.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.BadRequest",
    "fieldViolations": [
      {
        "description": "Invalid JSON payload received. Unknown name \"memcacheParameters\" at 'resource': Cannot find field.",
        "field": "resource"
      }
    ]
  }
]

  on main.tf line 17, in resource "google_memcache_instance" "self":
  17: resource "google_memcache_instance" "self" {


[terragrunt] 2020/07/17 11:04:19 Hit multiple errors:
exit status 1
```